<template>
  <div> 
    <!-- TODO по клику на текст, текст преврщается из обычного блока в текст эреа.
      должны появляться кнопка отмены и сохранения.
      после потери фокусировки
    -->
    <div class="">
      <img class="img-fluid rounded mx-auto d-block" 
          src="http://placehold.it/1400x300" 
          alt="Иллюстрация" 
          style="max-height: 250px;"
      >
    </div>
    <div class="">
      <h3>
        <textarea class="text-center h3 w-100 form-control-plaintext" id="gameName" rows="1">Суп "Солянка"</textarea>
      </h3>
      <p class="" id="gameDescription" >
        Суп солянка классическая отлично пойдет на второй-третий день праздника — когда народ  захочет чего-либо горяченького вместо поднадоевших салатов. Чувствуете в себе силы выполнить это пожелание? Тогда вперед! Кстати, приготовление солянки поможет вам реализовать остатки мясной нарезки, которая выглядит не лучшим образом и вряд ли будет съедена в чистом виде.
      </p>
      <!-- TODO количество строк -->
      <!-- <textarea class="w-100 form-control-plaintext" 
                id="gameDescription" 
                rows="7"
      >
        Суп солянка классическая отлично пойдет на второй-третий день праздника — когда народ  захочет чего-либо горяченького вместо поднадоевших салатов. Чувствуете в себе силы выполнить это пожелание? Тогда вперед! Кстати, приготовление солянки поможет вам реализовать остатки мясной нарезки, которая выглядит не лучшим образом и вряд ли будет съедена в чистом виде.
      </textarea> -->
    </div>

    <!-- TODO добавить список участников, у которых есть роль, кстати
              добавить настройки (акордеон подойдет, кмк)
    -->
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue'

export default defineComponent({

})
</script>

<style lang="scss" scoped>

#gameName, #gameDescription {
  color: white;
}

</style>
